Repository: simovdarko/Bugify
Catalog: lib/l10n/app_*.arb
Languages: mk

# splashSubtitle
source: Insect Identification
mk: Идентификација на инсекти

# homeTitle
source: Main menu
mk: Главно мени

source: Recognize Insect
mk: Препознај инсект

# history
source: Insect History
mk: Историја на инсекти

# about
source: About App
mk: За апликацијата

source: Back
mk: Назад

# noHistory
source: No recognition history found
mk: Нема историја на препознавања

# deleteConfirmation
source: Are you sure you want to delete "{insectName}"?
mk: Дали сте сигурни дека сакате да го избришете "{insectName}"?

source: Cancel
mk: Откажи

source: Delete
mk: Избриши

# developedBy
source: Developed by: Andreja Dimkovski, Darko Simov FINKI, 2025
mk: Развиено од: Андреја Димковски, Дарко Симов ФИНКИ, 2025 година

# version
source: Version: 1.0.0
mk: Верзија: 1.0.0

# notThisInsect
source: Not this insect? Scan again
mk: Не е овој инсект? Скенирај повторно

# fromCamera
source: Camera
mk: Камера

# fromGallery
source: Gallery
mk: Галерија

source: No image selected
mk: Нема избрано слика

# recognitionError
source: Error recognizing the insect
mk: Грешка при препознавање на инсектот

source: DETAILS
mk: ДЕТАЛИ

# region
source: Regions
mk: Региони

source: Active Period
mk: Активен период

# flowerPreference
source: Preferred Plants
mk: Преферирани растенија

source: Diet
mk: Исхрана

source: Dangerous
mk: Опасен

source: Yes
mk: Да

source: No
mk: Не

source: Type
mk: Тип

source: Size
mk: Големина

source: Lifespan
mk: Животен век

# backToMenu
source: Back to Main Menu
mk: Назад кон главното мени

# aboutAppTitle
source: About the App
mk: За апликацијата

# aboutAppDescription1
source: Bugify is a mobile application that uses artificial intelligence to recognize insects from images.
mk: Bugify е мобилна апликација која користи вештачка интелигенција за препознавање на инсекти преку слика.

# aboutAppDescription2
source: With this app you can: • Scan insects via camera or gallery • View detailed information • Browse scanning history • Learn more about the insects around you
mk: Со оваа апликација можете: • Да скенирате инсекти преку камера или галерија • Да ги видите деталните информации • Да прегледате историја на скенирања • Да научите повеќе за инсектите околу вас

# aboutTitle
source: About the App
mk: За апликацијата

# aboutIntro
source: Bugify is a mobile application that uses artificial intelligence to recognize insects from images.
mk: Bugify е мобилна апликација која користи вештачка интелигенција за препознавање на инсекти преку слика.

# aboutFeatures
source: With this app you can: • Scan insects via camera or gallery • View detailed information • Browse scan history • Learn more about local insects
mk: Со оваа апликација можете: • Да скенирате инсекти преку камера или галерија • Да ги видите деталните информации • Да прегледате историја на скенирања • Да научите повеќе за инсектите околу вас

# aboutCredits
source: Developed by: Andreja Dimkovski, Darko Simov FINKI, 2025
mk: Развиено од: Андреја Димковски, Дарко Симов ФИНКИ, 2025 година

# confirmDelete
source: Are you sure you want to delete?
mk: Дали сте сигурни дека сакате да го избришете?

# seenOn
source: Seen on: {dateTime}
mk: Видено на: {dateTime}

source: Scan Insect
mk: Препознај Инсект

# retryScan
source: Not this insect? Scan again
mk: Не е овој инсект? Скенирај повторно

source: Camera
mk: Камера

source: Gallery
mk: Галерија

source: Show Another Fact
mk: Покажи друг факт

# funFactTitle
source: Fun Insect Fact
mk: Интересен факт за инсекти

source: Fun Facts
mk: Интересни факти
